{
    "truth": [
        "Kapan terakhir kali ngompol?",
        "Momen paling memalukan apa yang kamu rasakan sebulan terakhir?",
        "Kalau kamu bisa pilih kekuatan super, mau punya kekuatan apa?",
        "Kalau kamu bisa menghilang, apa hal pertama yang kamu lakukan?",
        "Kalau kamu bisa baca pikiran, pikiran siapa yang bakal kamu baca duluan?",
        "Berapa jam kamu tidur paling lama?",
        "Siapa celebrity crush kamu?",
        "Mimpi paling aneh yang pernah kamu alami?",
        "Skenario paling aneh yang pernah terlintas di pikiranmu tentang kita?",
        "Video TikTok atau YouTube paling memalukan yang pernah kamu tonton?",
        "Film/serial/drama/anime paling memalukan yang pernah kamu tonton?",
        "Cerita Wattpad/fan fiction/buku paling memalukan yang pernah kamu baca?",
        "Kalau kamu cuma bisa makan satu jenis makanan seumur hidup, mau makan apa?",
        "Hal kecil apa yang pernah dilakukan (nama orang) dan bikin kamu senang banget?",
        "Apa kartun favorit kamu pas kecil?",
        "Kalau bisa jadi tokoh fiksi selama sehari, mau jadi apa?",
        "Siapa orang terakhir yang kamu stalking di media sosial?",
        "Kalau ada jin kasih kamu tiga permintaan, mau minta apa aja? (Ide bagus buat yang mau ulang tahun)",
        "Apa love language kamu?",
        "Apa quotes favoritmu?",
        "Artis atau lagu apa yang paling sering kamu putar pas lagi down?",
        "Apa insecurity terbesarmu?",
        "Kapan terakhir kali bohong ke orang tua?",
        "Hal apa yang kamu harapkan bisa kamu ubah dari diri sendiri?",
        "Apa pet peeve terbesarmu?",
        "Kapan terakhir kali bohong? (Dilarang bilang ”Aku gak pernah bohong, nah itu aku baru bohong“)",
        "Kapan terakhir kali menangis?",
        "Apa ketakutan terbesarmu?",
        "Apa penyesalan terbesarmu?",
        "Kalau kamu nggak bisa ketemu kita lagi besok, apa yang mau kamu sampaikan atau lakukan?",
        "Momen life-changing yang pernah kamu alami",
        "Kalau kamu bisa jadi tidak terlihat, apa hal pertama yang akan kamu lakukan?",
        "Apa rahasia yang kamu sembunyikan dari orangtuamu?",
        "Siapa orang yang diam-diam kamu sukai?",
        "Siapa orang terakhir yang kamu kepoin di media sosial?",
        "Kalau ada jin yang memberikanmu tiga permohonan, apa yang kamu inginkan?",
        "Siapa orang di antara kita yang menurutmu bisa lolos dari kiamat zombie dan siapa yang akan mati duluan? Beri tahu alasannya!",
        "Apa tontonan favoritmu saat masih kecil?",
        "Siapa orang yang paling sering kamu chat?",
        "Apa kebohongan terbesar yang pernah kamu katakan kepada orangtuamu?",
        "Apa mimpi paling aneh yang pernah kamu alami?",
        "Ceritakan detail ciuman pertamamu…",
        "Kapan terakhir kali kamu ngompol?",
        "Menurutmu, hewan apa yang terlihat paling mirip denganmu?",
        "Di antara kita, siapa orang yang paling kamu suka dalam konteks romantis?",
        "Di antara kita, siapa orang yang menurutmu paling baik dan paling buruk sifatnya?",
        "Siapa mantan terindahmu?",
        "Siapa orang yang ingin kamu jadikan istri/suami?",
        "Apakah kamu pernah melakukan ghosting?",
        "Apa aib yang kamu sembunyikan dari kami?",
        "Berapa jumlah mantanmu?"
    ],
    "dare": [
        "Katakan ‘meong’ di setiap akhir kalimat sampai giliranmu yang selanjutnya.",
        "Tirukan seorang selebriti sampai ada yang bisa menebak.",
        "Bertingkahlah seperti ayam sampai giliranmu yang selanjutnya.",
        "Ungkapkan persaanmu kepada gebetanmu.",
        "Vn, tahan nafas selama 30 detik.",
        "Kayang selama satu menit.",
        "Plank selama satu menit.",
        "Baca dengan lantang pesan yang terakhir kali kamu kirim ke gebetanmu.",
        "Telepon seorang teman dan katakan selamat ulang tahun sambil menyanyikan lagu.",
        "Tunjukkan gerakan dance terbaikmu.",
        "Bilang I Love You kepada sahabat",
        "Ulangi setiap perkataan orang yang ada di sampingmu sampai giliranmu yang selanjutnya."
    ]
}